<a href="https://colab.research.google.com/github/Remaaa17/Data_Preprocessing-ML/blob/main/Copy_of_Task3.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

#Data Preprocessing

### Importing Modules

In [ ]:
import numpy as np
import pandas as pd
import seaborn as sns
import matplotlib.pyplot as plt
from sklearn.preprocessing import LabelEncoder, StandardScaler

### Load Dataset

In [ ]:
file_path = r"/content/titanic_data.csv"
Titanic_df = pd.read_csv(file_path)
# Display the first few rows of the DataFrame
print("Titanic DataFrame:")
Titanic_df.head(30)

Titanic DataFrame:

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True
5,0,3,male,NaN,0,0,8.4583,Q,Third,man,True,NaN,Queenstown,no,True
6,0,1,male,54.0,0,0,51.8625,S,First,man,True,E,Southampton,no,True
7,0,3,male,2.0,3,1,21.0750,S,Third,child,False,NaN,Southampton,no,False
8,1,3,female,27.0,0,2,11.1333,S,Third,woman,False,NaN,Southampton,yes,False
9,1,2,female,14.0,1,0,30.0708,C,Second,child,False,NaN,Cherbourg,yes,False
10,1,3,female,4.0,1,1,16.7000,S,Third,child,False,G,Southampton,yes,False
11,1,1,female,58.0,0,0,26.5500,S,First,woman,False,C,Southampton,yes,True
12,0,3,male,20.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True
13,0,3,male,39.0,1,5,31.2750,S,Third,man,True,NaN,Southampton,no,False
14,0,3,female,14.0,0,0,7.8542,S,Third,child,False,NaN,Southampton,no,True
15,1,2,female,55.0,0,0,16.0000,S,Second,woman,False,NaN,Southampton,yes,True
16,0,3,male,2.0,4,1,29.1250,Q,Third,child,False,NaN,Queenstown,no,False
17,1,2,male,NaN,0,0,13.0000,S,Second,man,True,NaN,Southampton,yes,True
18,0,3,female,31.0,1,0,18.0000,S,Third,woman,False,NaN,Southampton,no,False
19,1,3,female,NaN,0,0,7.2250,C,Third,woman,False,NaN,Cherbourg,yes,True
20,0,2,male,35.0,0,0,26.0000,S,Second,man,True,NaN,Southampton,no,True
21,1,2,male,34.0,0,0,13.0000,S,Second,man,True,D,Southampton,yes,True
22,1,3,female,15.0,0,0,8.0292,Q,Third,child,False,NaN,Queenstown,yes,True
23,1,1,male,28.0,0,0,35.5000,S,First,man,True,A,Southampton,yes,True
24,0,3,female,8.0,3,1,21.0750,S,Third,child,False,NaN,Southampton,no,False
25,1,3,female,38.0,1,5,31.3875,S,Third,woman,False,NaN,Southampton,yes,False
26,0,3,male,NaN,0,0,7.2250,C,Third,man,True,NaN,Cherbourg,no,True
27,0,1,male,19.0,3,2,263.0000,S,First,man,True,C,Southampton,no,False
28,1,3,female,NaN,0,0,7.8792,Q,Third,woman,False,NaN,Queenstown,yes,True
29,0,3,male,NaN,0,0,7.8958,S,Third,man,True,NaN,Southampton,no,True

In [ ]:
Titanic_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 889 entries, 0 to 888
Data columns (total 15 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   survived     889 non-null    int64
 1   pclass       889 non-null    int64
 2   sex          889 non-null    object
 3   age          713 non-null    float64
 4   sibsp        889 non-null    int64
 5   parch        889 non-null    int64
 6   fare         889 non-null    float64
 7   embarked     887 non-null    object
 8   class        889 non-null    object
 9   who          889 non-null    object
 10  adult_male   889 non-null    bool
 11  deck         203 non-null    object
 12  embark_town  887 non-null    object
 13  alive        889 non-null    object
 14  alone        889 non-null    bool
dtypes: bool(2), float64(2), int64(4), object(7)
memory usage: 92.2+ KB

In [ ]:
Titanic_df.shape

(889, 15)

In [ ]:
misiing_value=Titanic_df.isnull().sum()
misiing_value

survived         0
pclass           0
sex              0
age            176
sibsp            0
parch            0
fare             0
embarked         2
class            0
who              0
adult_male       0
deck           686
embark_town      2
alive            0
alone            0
dtype: int64

In [ ]:
# Check the spelling of the column names
print(Titanic_df.columns)

# Ensure that the columns you are trying to drop exist in the DataFrame
if all(column in Titanic_df.columns for column in ['class', 'deck', 'alive']):
    # Drop the columns
    Titanic_df.drop(['deck', 'alive']), axis=0, inplace=True)
else:
    print("One or more of the specified columns does not exist in the DataFrame.")

SyntaxError: unmatched ')' (<ipython-input-62-30eb3c08cc8c>, line 7)

In [ ]:
sns.set_palette("bright")
sns.displot(data=Titanic_df, x="age", kind="kde")
plt.figure(figsize=(15,15))

>Filling the missing data with the median

In [ ]:
Titanic_df["age"].fillna(Titanic_df["age"].median(), inplace=True)

>Visualizing  data after handling missing values

In [ ]:
sns.set_palette("bright")
sns.displot(data=Titanic_df, x="age", kind="kde")

In [ ]:

Titanic_df.dropna(subset=['embark_town'], inplace=True)

> Drop null values in the "embark_town "column

In [ ]:
Titanic_df.isnull().sum()

>Show data after handling missing values

In [ ]:
Titanic_df

##Identifying & handling outliers

In [ ]:
import plotly.express as px
import pandas as pd

# Assuming Titanic_df is your DataFrame
# Set up your DataFrame here

# Filter numerical columns
numerical_cols = Titanic_df.select_dtypes(include=['int64', 'float64']).columns

# Loop through numerical columns and create box plots
for col in numerical_cols:
    # Create a box plot using Plotly Express
    fig = px.box(Titanic_df, y=col, title=f'Boxplot of {col}')
    fig.show()

In [ ]:
import plotly.express as px
import pandas as pd

# Set custom color palette
custom_palette = ['#FF6347', '#1E90FF']  # Example colors (tomato, dodgerblue)

# Create a box plot using Plotly Express
fig_box = px.box(Titanic_df, x='fare', color_discrete_sequence=custom_palette,
                 title='Boxplot of Fare')
fig_box.update_layout(xaxis_title='Fare', yaxis_title='Count')

# Create a scatter plot using Plotly Express
fig_scatter = px.scatter(Titanic_df, x='fare', y='class', color='class',
                         color_discrete_sequence=custom_palette,
                         title='Scatterplot of Fare vs Class')
fig_scatter.update_layout(xaxis_title='Fare', yaxis_title='Class')

# Show the plots
fig_box.show()
fig_scatter.show()


###Scale and Normalize data

In [ ]:
##take a cope of orginal data  before scaling
original_df = Titanic_df.copy()
original_df

In [ ]:
from sklearn.preprocessing import StandardScaler
##Scale numerical features using StandardScaler
scaler = StandardScaler()
numerical_features = ['age', 'fare']
Titanic_df[numerical_features] = scaler.fit_transform(Titanic_df[numerical_features])

In [ ]:
print(Titanic_df.head())

In [ ]:
print(Titanic_df[numerical_features].describe())

In [ ]:
import matplotlib.pyplot as plt
import seaborn as sns
from sklearn.preprocessing import StandardScaler

# Assuming Titanic_df is your DataFrame and scaler is your StandardScaler object

# Plotting age distribution before scaling
plt.figure(figsize=(10, 5))
sns.histplot(original_df['age'], kde=True, color='skyblue')
plt.title('Age Distribution (Before Scaling)')
plt.xlabel('Age')
plt.ylabel('Frequency')
plt.show()

# Plotting age distribution after scaling
plt.figure(figsize=(10, 5))
sns.histplot(Titanic_df['age'], kde=True, color='green')
plt.title('Age Distribution (After Scaling)')
plt.xlabel('Scaled Age')
plt.ylabel('Frequency')
plt.show()

In [ ]:
import matplotlib.pyplot as plt
import seaborn as sns
from sklearn.preprocessing import StandardScaler

# Assuming Titanic_df is your DataFrame and scaler is your StandardScaler object

# Plotting fare distribution before scaling
plt.figure(figsize=(10, 5))
sns.histplot(original_df['fare'], kde=True, color='skyblue')
plt.title('Fare Distribution (Before Scaling)')
plt.xlabel('Fare')
plt.ylabel('Frequency')
plt.show()

# Plotting fare distribution after scaling
plt.figure(figsize=(10, 5))
sns.histplot(Titanic_df['fare'], kde=True, color='green')
plt.title('Fare Distribution (After Scaling)')
plt.xlabel('Scaled Fare')
plt.ylabel('Frequency')
plt.show()

###Remove Duplicates

In [ ]:
Titanic_df.drop_duplicates()

###Dealing with Categorical data

In [ ]:
Titanic_df.dtypes

In [ ]:
from sklearn import preprocessing
le = preprocessing.LabelEncoder()
Titanic_df["sex"] = le.fit_transform(Titanic_df["sex"])
Titanic_df["embarked"] = le.fit_transform(Titanic_df["embarked"])
Titanic_df["embark_town"] = le.fit_transform(Titanic_df["embark_town"])
Titanic_df["who"] = le.fit_transform(Titanic_df["who"])
Titanic_df["class"] = le.fit_transform(Titanic_df["class"])
Titanic_df["alive"] = le.fit_transform(Titanic_df["alive"])
Titanic_df["alone"] = le.fit_transform(Titanic_df["alone"])
Titanic_df["adult_male"] = le.fit_transform(Titanic_df["adult_male"])

In [ ]:
from sklearn.preprocessing import OneHotEncoder

# Initialize OneHotEncoder
encoder = OneHotEncoder()

# Encode categorical variables and replace them in the DataFrame
encoded_features = encoder.fit_transform(Titanic_df[["sex", "embarked", "embark_town", "class","who","alive","alone","adult_male"]]).toarray()

# Get the feature names for the encoded features
feature_names = encoder.get_feature_names_out(["sex", "embarked", "embark_town", "class","who","alive","alone","adult_male"])

# Create a DataFrame with the encoded features
encoded_df = pd.DataFrame(encoded_features, columns=feature_names)

# Concatenate the encoded DataFrame with the original DataFrame
Titanic_df= pd.concat([Titanic_df.drop(columns=["sex", "embarked", "embark_town", "class","who","alive","alone","adult_male"]), encoded_df], axis=1)

# Display the modified DataFrame
print(Titanic_df)

In [ ]:
Titanic_df

#####**What was the average fare for passengers from each town?**

In [ ]:
original_df.groupby(['embark_town'])['fare'].mean().reset_index()

In [ ]:
import matplotlib.pyplot as plt
import seaborn as sns

# Assuming original_df contains your data and the groupby operation is done correctly

# Group by 'embark_town' and calculate the mean of 'fare'
fare_mean = original_df.groupby(['embark_town'])['fare'].mean().reset_index()

# Set the seaborn style
sns.set_style("whitegrid")

# Create a barplot using seaborn
plt.figure(figsize=(10, 6))
sns.barplot(data=fare_mean, x='embark_town', y='fare', palette='viridis')
plt.title('Mean Fare by Embark Town')
plt.xlabel('Embark Town')
plt.ylabel('Mean Fare')
plt.xticks(rotation=45)  # Rotate x-axis labels for better visibility
plt.show()

#####**What was the average fare for male vs female passengers from each town?**

In [ ]:
original_df.groupby(['embark_town','sex'])['fare'].mean().reset_index()

In [ ]:
import plotly.express as px
import pandas as pd

# Assuming original_df contains your data and the groupby operation is done correctly

# Group by 'embark_town' and 'sex' and calculate the mean of 'fare'
fare_mean = original_df.groupby(['embark_town', 'sex'])['fare'].mean().reset_index()

# Create a grouped bar chart using Plotly Express
fig = px.bar(fare_mean, x='embark_town', y='fare', color='sex',
             title='Mean Fare by Embark Town and Sex',
             labels={'embark_town': 'Embark Town', 'fare': 'Mean Fare', 'sex': 'Sex'},
             barmode='group')
fig.show()

####**What is the total number of passengers from each class who survived?**

In [ ]:
original_df.groupby(['class'])['survived'].sum().reset_index()

In [ ]:
import matplotlib.pyplot as plt
import seaborn as sns

# Assuming original_df contains your data and the groupby operation is done correctly

# Group by 'class' and calculate the sum of 'survived'
survived_counts = original_df.groupby(['class'])['survived'].sum().reset_index()

# Create the count plot
plt.figure(figsize=(10, 6))
sns.barplot(data=survived_counts, x='class', y='survived', palette='viridis')
plt.title('Counts of Survived Passengers by Class')
plt.xlabel('Class')
plt.ylabel('Survived Count')
plt.show()

####Get the sum & mean of fare, AND median, min and max of age for each age category (who column) from each town

In [ ]:
#Define aggregations as a dictionary
g = {'fare':['sum', 'mean'],
     'age':['median', 'min', 'max']
    }

original_df.groupby(['embark_town', 'who']).agg(g).reset_index()